# GetHubId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..GetHubId Method
ReferencePoint Class See Also
---
Id of associated Hub.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetHubId()
```

Visual Basic
---
```text
Public Function GetHubId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetHubId()
```

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace